---
kind: method
id: M:Autodesk.Revit.DB.BaseExportOptions.GetExportLayerTable
source: html/1ce6b604-0b45-f05f-863e-952b85e5a862.htm
---
# Autodesk.Revit.DB.BaseExportOptions.GetExportLayerTable Method

Gets the layer table.

## Syntax (C#)
```csharp
public ExportLayerTable GetExportLayerTable()
```

## Returns
The layer table.